import starkString from "starkstring";
import db from "../../database/setup";

const maxBeforeResStart = starkString(`${db.get("maxTimeBeforeDelete")}`)
  .arabicNumber()
  .toString();

// القائمة الرئيسية
// توثيق - ملفي - حجز - الغاء - تنشيط - متابعة - تمرير
export const mainMenu = `🌟 *مرحبا بك في منظومة المذاكرة* 🌟\n\nأرسل أحد الكلمات التالية للحصول على معلومات عن كيفية استخدام المنظومة:\n\n    📱 *توثيق*\n    --- _لتوثيق هاتفك وربطه بحسابك الشخصي_\n\n    👤 *ملفي*\n    --- _لمتابعة الملف الشخصي_\n\n    🔘 *حجز*\n    --- _لحجز موعد للمذاكرة_\n\n    🔳 *الغاء*\n    --- _لإلغاء حجز مسبق_\n\n    🔆 *تنشيط*\n    --- _لتنشيط حجز مع المشرف_\n\n    🔍 *متابعة*\n    --- _لمتابعة مواعيد المذاكرة_\n\n    🔀 *تمرير*`;

// توثيق
export const verifyMenu = `📱 *لتوثيق رقم هاتفك* 📱\n\nأرسل كلمة *!توثيق* متبوعة بالرقم الشخصي\n⚠ ملحوظة هامة: الأرقام يجب أن تكون بالأنجليزية\n\n*مثال*:\n\`\`\`!توثيق 12345\`\`\``;

// متابعة
export const trackingMenu = `📅 *لمتابعة جدول المذاكرة* 📅\n\n    أرسل أحد الخبارات التالية:    \n\n    🔲 *!متابعة المتبقى من اليوم*\n    --- _لعرض المتبقي من حجوزات اليوم_\n\n    🔘 *!متابعه المتبقى من الاسبوع*\n    --- _لعرض جدول المذاكرة خلال الأسبوع_\n\n    🔳 *!متابعه [يوم]*\n    --- _للحصول على جدول المذاكرة الخاصة بيوم محدد_\n    --- _مثال: متابعه الخميس_`;

// إلغاء
export const cancelMenu = `🚫 * لإلغاء حجز مسبق * 🚫\n\n ارسل كلمة *!إلغاء* لإلغاءالحجز الخاص بك\n\n⚠️ الحد الأدنى لإلغاء الحجز هو ${maxBeforeResStart} قبل موعد بدء الحجز\nإذا تجاوزت الموعد المحدد للحذف يمكنك فقط تمرير الحجز`;

// تنشيط
export const activationMenu = `✅ *لتنشيط حجز لبدء المذاكرة* ✅\n\nتبدأ مهلة تنشيط الحجز قبل بدءه خمس دقائق وحتى عشر دقائق من بدءه\n    *آلية التنشيط*\n    -- أرسل كلمة *!تنشيط*\n    -- توجه إلى أقرب مشرف للحصول على رمز التنشيط\n    -- أرسل كلمة *!تنشيط* مصحوبة بالرمز ليصبح الحجز نشط\n    -- منذ تلك اللحظة الحجز أصبح نشط ومعلن وتحت إشراف المشرف`;

// حجز
export const bookingMenu1 = `🔘 *لحجز موعد مذاكرة* 🔘\n\nأرسل كلمة *!حجز* متبوعة بتفاصيل الحجز\n\nيمكنك التعبير عن موعد ومكان الحجز بأي طريقة ممكنه .. المنظومة تمتلك الذكاء الكافي لفهم الموعد\n*مثال*: بكره الساعة تسعة الصبح في 109`;
export const bookingMenu2 = `⚠️ تنبيهات هامة\n    -- اختيار الموعد يقع بالكامل على مسئوليتك..يجب التأكد من إتاحة الغرفة بالجدول قبل حجز الموعد\n    -- يمكنك حجز أي موعد من مساء الخميس في الاسبوع الذي يسبقه وحتى  بدء توقيته بخمس دقائق\n    -- مدة الحجز الواحد هي ثلاثون دقيقة\n    -- يمكنك حجز موعد واحد كل مرة وفور تنشيط الحجز يمكنك حجز موعد آخر\n     --يكون الحجز في الفترة المحددة من قبل الكليةوخلال أيام العمل`;
export const bookingMenu3 = `⚖️ منظومة الجزاءات\n\nيهدف هذا النظام إلى تحفيز الطلاب على الالتزام بتنفيذ حجز المذاكرة.\n النظام يراعي أيضًا أن يكون الجزاء متناسبًا مع عدد المخالفات التي ارتكبها الطالب. فكلما زادت عدد المخالفات، زادت مدة الجزاء.\nيعتمد النظام العام على مبدأ التناسب، حيث يتم تطبيق جزاءات متزايدة مع تكرار المخالفات. يبدأ النظام بفرض جزاء لمدة ثلاثة أيام عند الوصول للمخالفة الثالثة. ثم بعد كل مخالفتين يتم فرض جزاء جديدة وتضرب عدد الجزاءات في ثلاثة أيام.`;

// مواعيدي
export const mySceduleMenu = `🔲 *لعرض تفاصيل مواعدي الحجز الخاصة بك* 🔲\n\nأرسل كلمة *!مواعيدي* لعرض قائمة بالمواعيد المحجوزة`;

// مخالفاتي
export const myViolationsMenu = `⚖️ لعرض المخالفات التي قمت ارتكبتها\nأرسل *!مخالفات* لتتطلع على تفاصيل المخالفات الخاصة بك إن وجدت`;

// استعادة
export const restoreMenu1 = `🔁 *لاستعادة حساب حال تغيير رقم الهاتف* 🔁\n أرسل كلمة *!استعادة* متبوعة برقم الهاتف`;
export const restoreMenu2 = `بالنسبة للأرقام المصرية\nيمكن كتابة الرقم بأي من الصيغ التالية\n    -- 01022222222\n    -- 20102020202020\n    -- 00201020202020`;
export const restoreMenu3 = `بالنسبة للأرقام غير المصرية\nيمكن كتابة الرقم مع مفتاح الدولة بدون 00 أو +\n\n_مثال_\n    يجب كتابتها مسبوقة بمفتاح الدولة بدون كتابة 00 أو + في البداية.\nكمثال، إذا كانت دولة عمان هي 968 ورقم الهاتف 93565656، يُكتب رقم الهاتف 96893565656. لتكون الرسالة "!توثيق 96893565656"`;

// حجب
export const dayBlockMenu = `🚫 *لحجب يوم أسبوعياً* 🚫\nأرسل كلمة *!حجب* متبوعة بالإجراء ومن ثم اسم اليوم\n\nكمثال: !حجب إضافة الجمعة وحذف السبت\nملحوظة: الإضافة تعني إضافة اليوم إلى قائمة الحجب`;
export const dateBlockMenu = `📅 *لحجب تاريخ محدد* 📅\nأرسل كلمة *!حجب تاريخ* وتابع التعليمات وأجب عن الأسئلة لإضافة أو حذف تاريخ محدد\n\nملحوظة:تتيح لك المنظومة إضافة تاريخ يتم حجبه سنويا وهومناسب للأعياد الرسمية`;

// لوقف منظومة الحجز
export const BookingStatusMenu = `💾 ** 💾\n`;

// غرف
export const RoomsMenu = `🏢 ** 🏢\n`;
