import {
  arabicDays,
  arabicHours,
  arabicMinuets,
  enToAr,
} from "../../config/diff";
import db from "../../database/setup";

// القائمة الرئيسية
// توثيق - ملفي - حجز - الغاء - تنشيط - متابعة - تمرير
const main = `🌟 *مرحبا بك في منظومة المذاكرة* 🌟\n\nأرسل أحد الكلمات التالية للحصول على معلومات عن كيفية استخدام المنظومة:\n\n    📱 *توثيق*\n    --- _لتوثيق هاتفك وربطه بحسابك الشخصي_\n\n    👤 *ملفي*\n    --- _لمتابعة الملف الشخصي_\n\n    🔘 *حجز*\n    --- _لحجز موعد للمذاكرة_\n\n    🔳 *الغاء*\n    --- _لإلغاء حجز مسبق_\n\n    🔆 *تنشيط*\n    --- _لتنشيط حجز مع المشرف_\n\n    🔍 *متابعة*\n    --- _لمتابعة مواعيد المذاكرة_\n\n    🔀 *تمرير*`;

// توثيق
const verify = `📱 *لتوثيق رقم هاتفك* 📱\n\nأرسل 👈 *!توثيق* 👉 متبوعة بالرقم الشخصي\n⚠ ملحوظة هامة: الأرقام يجب أن تكون بالأنجليزية\n\n*مثال*:\n!توثيق ${enToAr(
  "12345"
)}`;

// متابعة
const tracking = `📅 *لمتابعة جدول المذاكرة* 📅\n\n    أرسل أحد الخبارات التالية:    \n\n    🔲 👉 *!متابعة المتبقى من اليوم* 👈\n    --- _لعرض المتبقي من حجوزات اليوم_\n\n    🔘 👉 *!متابعه المتبقى من الاسبوع* 👈\n    --- _لعرض جدول المذاكرة خلال الأسبوع_\n\n    🔳 👉 *!متابعه [يوم]* 👈\n    --- _للحصول على جدول المذاكرة الخاصة بيوم محدد_\n    --- _مثال: متابعه الخميس_`;

// إلغاء
const cancel = `🚫 * لإلغاء حجز مسبق * 🚫\n\n ارسل كلمة 👈 *!إلغاء* 👉 لإلغاءالحجز الخاص بك\n\n⚠️ الحد الأدنى لإلغاء الحجز هو ${arabicHours(
  db.get("maxTimeBeforeDelete")
)} قبل موعد بدء الحجز\nإذا تجاوزت الموعد المحدد للحذف يمكنك فقط تمرير الحجز`;

// تنشيط
const activation1 = `✅ *لتنشيط حجز لبدء المذاكرة* ✅\n\nتبدأ مهلة تنشيط الحجز قبل بدءه ${arabicMinuets(
  db.get("activatingPeriodBeforeStart")
)} وحتى ${arabicMinuets(db.get("activatingPeriodAfterStart"))} من بدءه`;
const activation2 = `*آلية التنشيط*\n -- أرسل 👈 *!تنشيط* 👉\n -- توجه إلى أقرب مشرف للحصول على رمز التنشيط\n -- أرسل كلمة *!تنشيط* مصحوبة بالرمز ليصبح الحجز نشط\n -- منذ تلك اللحظة الحجز أصبح نشط ومعلن وتحت إشراف المشرف`;
const activationTeacher1 = `✅ *لتنشيط حجز لبدء المذاكرة* ✅\n\nبعد أن يقوم الطالب بإنهاء إجراءاته الأولى من هاتفه الشخصي وستواصل معك`;
const activationTeacher2 = `أرسل 👈 *!تنشيط* 👉 لتحصل على قائمة بالطلاب كل طالب متبوع برقم مميز شارك الطالب الرقم الخاص به فقط\nبعد استخدام الطالب للرقم الذي شاركته معه يصبح الحجز نشط وتصبح مشرفاً عليه\n\nإن لم يكن هناك أية طلاب ينتظرون الرقم سيتم إعلامك بذلك`;

// حجز
const booking1 = `🔘 *لحجز موعد مذاكرة* 🔘\n\nأرسل كلمة 👈 *!حجز* 👉 متبوعة بتفاصيل الحجز\n\nيمكنك التعبير عن موعد ومكان الحجز بأي طريقة ممكنه .. المنظومة تمتلك الذكاء الكافي لفهم الموعد\n*مثال*: بكره الساعة تسعة الصبح في ${enToAr(
  "109"
)}`;
const booking2 = `⚠️ تنبيهات هامة\n\n🔹اختيار الموعد يقع بالكامل على مسئوليتك..يجب التأكد من إتاحة الغرفة بالجدول قبل حجز الموعد\n🔹يمكنك حجز أي موعد من مساء الخميس في الاسبوع الذي يسبقه وحتى  بدء توقيته ب${arabicMinuets(
  db.get("activatingPeriodAfterStart")
)} \n🔹 مدة الحجز الواحد هي ثلاثون دقيقة\n🔹يمكنك حجز موعد واحد كل مرة وفور تنشيط الحجز يمكنك حجز موعد آخر\n🔹يكون الحجز في الفترة المحددة من قبل الكليةوخلال أيام العمل`;
const booking3 = `⚖️ منظومة الجزاءات\n\nيهدف هذا النظام إلى تحفيز الطلاب على الالتزام بتنفيذ حجز المذاكرة.\n🔹النظام يراعي أيضًا أن يكون الجزاء متناسبًا مع عدد المخالفات التي ارتكبها الطالب. فكلما زادت عدد المخالفات، زادت مدة الجزاء.\n🔹يعتمد النظام العام على مبدأ التناسب، حيث يتم تطبيق جزاءات متزايدة مع تكرار المخالفات. يبدأ النظام بفرض جزاء لمدة ${arabicHours(
  db.get("punishmentUnit")
)} عند الوصول للمخالفة الثالثة.\n🔹ثم بعد كل مخالفتين يتم فرض جزاء جديدة وتضرب عدد الجزاءات في ${arabicDays(
  db.get("punishmentUnit")
)}.`;

// مواعيدي
const myScedule = `🔲 *لعرض تفاصيل مواعدي الحجز الخاصة بك* 🔲\n\nأرسل كلمة 👈 *!مواعيدي* 👉 لعرض قائمة بالمواعيد المحجوزة`;

// مخالفاتي
const myViolations = `⚖️ لعرض المخالفات التي قمت ارتكبتها\nأرسل 👈 *!مخالفات* 👉 لتتطلع على تفاصيل المخالفات الخاصة بك إن وجدت`;

// استعادة
const restore1 = `🔁 *لاستعادة حساب حال تغيير رقم الهاتف* 🔁\n أرسل كلمة 👈 *!استعادة* 👉 متبوعة برقم الهاتف`;
const restore2 = `بالنسبة للأرقام المصرية\nيمكن كتابة الرقم بأي من الصيغ التالية\n    -- ${enToAr(
  "01022222222"
)}\n    -- ${enToAr("20102020202020")}\n    -- ${enToAr("00201020202020")}`;
const restore3 = `بالنسبة للأرقام غير المصرية\nيمكن كتابة الرقم مع مفتاح الدولة بدون ${enToAr(
  "00"
)} أو +\n\n_مثال_\nكمثال، إذا كانت دولة عمان هي ${enToAr(
  "968"
)} ورقم الهاتف ${enToAr("93565656")}، يُكتب رقم الهاتف ${enToAr(
  "96893565656"
)}. لتكون الرسالة "!توثيق ${enToAr("96893565656")}"`;

// حجب
const dayBlock = `🚫 *لحجب يوم أسبوعياً* 🚫\nأرسل كلمة 👈 *!حجب* 👉 متبوعة بالإجراء ومن ثم اسم اليوم\n\nكمثال: !حجب إضافة الجمعة وحذف السبت\nملحوظة: الإضافة تعني إضافة اليوم إلى قائمة الحجب`;

// حجب تاريخ
const dateBlock = `📅 *لحجب تاريخ محدد* 📅\nأرسل كلمة 👈 *!حجب تاريخ* 👉 وتابع التعليمات وأجب عن الأسئلة لإضافة أو حذف تاريخ محدد\n\nملحوظة:تتيح لك المنظومة إضافة تاريخ يتم حجبه سنويا وهومناسب للأعياد الرسمية`;

// حالة المنظومة => لوقف منظومة الحجز
const BookingStatus = `💾 *لتغيير حالة تشغيل المنظومة* 💾\nأرسل 👈 *!حالة المنظومة* 👉 واتبع التعليمات خطوة بخطوة*`;
const BookingStatus2 = `توفر المنظومة ثلاث خيارات لإيقاف استقبال حجوزات جديدة\nإيقاف حتى إشعار آخر أو لأجل غير مسمى، مع تنشيطة يتم إلغاء كفافة المواعيد المحجوزة من لحجة الإيقاف ومن ثم وقف اتاحة الحجز\nالخيار الثاني هو إيقاف الحجز خلال المتبقي من اليوم حيث يتم إلغاء الحجز من لحظة القرار وحتى نهاية اليوم الدراسي\nالخيار الثالث هو إيقاف الحجز حتى تاريخ محدد حيث يتم إلغاء كافة الحجوزات خلال تلكا لفترة ومن ثم إيقاف استقبال أي حجز حتى هذه الفترة\nكما تتيح خيار اتاحة الحجز الذي تم إيقافه لأجل غير مسمى`;

// غرف
const Rooms1 = `🏢 *لإضافة أو حذف غرفة لقائمة الغرف المتاحة للمذاكرة* 🏢\nأرسل كلمة 👈 *!غرف* 👉 متبوعة بالإجراء ومن ثم اسم الغرفة\n\nكمثال: !غرف إضافة معمل-أ وحذف ${enToAr(
  "قاعه-106"
)}`;
const Rooms2 = `⚠️ تنبيه هام: إذا كان اسم الغرفة مكون من أكثر من كلمة افصل بين الكلمات بشرطة\nمثال: معمل-أ غرفة-علم-النفس`;

// تمرير
const throw1 = `🔀 *لتمرير موعد مذاكرة إلى أحد زملاءك* 🔀\nيمكن للطالب الذي تجاوز الفترة المسموحة لإلغاء الحجز أن يستخدم ميزة التمرير وهي الميزة التي صممت خصيصا لتحفيذ  الطلاب على مؤاذرة الطلاب لزملائهم وعدم ترك حجز للإهدار`;
const throw2 = `تعتمد آلية التمرير على ثلاث مراحل تبدأ بعد مرور ${arabicMinuets(
  db.get("availPeriodStarts")
)} من بدء موعد الحجز وقبل مرور ${arabicMinuets(
  db.get("availPeriodEnds")
)} من بداية الحجز بان يرسل صاحب الحجز كلمة "!تمرير"`;
const throw3 = `سيتم إعلان كل من الطالب نفسه وكل الطلاب على مجموعة الواتس آب برقم مميز\nعلى الطالب الراغب في يتلقى التمرير أن يرسل كلمة 👈 "!تمرير" 👉 متبوعة بالرقم المميز ثم يتوجه للمشرف خلال ${arabicMinuets(
  db.get("verifyPickupAvailDeadLine")
)} من إرساله للرسالة للتمرير وذلك لتنشيط الحجز`;
const throw4 = `المشرف سوف يرسل نفس الرسالة 👈 "!تمرير" 👉 متبوعة بنفس الرقم المميز لتنشيط الحجز مباشر`;
const throw5 = `⚠️تنبيه هام: \nفي حالة عدم تنشيط الحجز الممرر خلال المهلة يتحمل الطالب الممرر له الحجز مخالفة التخلف عن الحضور\nفي حالة عدم تمكن الطالب من تمرير الحجز الخاص به لأحد زملائه يتحمل مخالفة التخلف عن الحضور`;
const throwTeacher = `🔀 *لتمرير موعد مذاكرة إلى أحد زملاءك* 🔀\n\nبعد أن يعلن الطالب عن حاجته لتمرير الحجز الخاص به\nوبعد أن يعلن أحد زملائه عن رغبته باستلام التمرير\nيجب أن يواصل معك الطالب الممرر له الحجز ويشاركك رقم مميز\nالآن أرسل كلمة 👈 *!تمرير* 👉 متبوعة  بالرقم المميز\nمن الآن أصبح الحجز نشط وأصبحت أنت المشرف على الطالب`;

// عرض القواعد
const showRules = `📋 *لمتابعة قواعد المنظومة المسيرة لمنظومة المذاكرة والمتابعة* 📋\nأرسل 👈 *!عرض القواعد* 👉 لعرض قائمة القواعد المحدثة`;

// قواعد الحجز
const RulesEditing = `💼 *لتعديل القواعد المسيرة لمنظومة المذاكرة والمتابعة* 💼\nأرسل كلمة 👈 *!قواعد الحجز* 👉 وسيصلك رسالة بكل الخيارات المتاحة للتعديل\nاستخدم اسم القاعدة المطلوبة متبوع بالقيمة الجديدة`;

// صلاحيات
const permissions = `🔐 *لترقية صلاحية احد الحسابات* 🔐\nلعرض صلاحيات الحسابات أرسل 👈 *!صلاحيات*👉\nلترقية أو تنزيل صلاحية حساب أرسل 👈 *!صلاحيات* 👉 متبوعة بالإجراء المطلوب إما ترقية متبوعة برقم الحساب أو تنزيل متبوعة برقم الحساب\nمثال: *!صلاحيات ترقية 111222*`;

// نسخة احتياطية
const backup = `💾 *يحتوي النظام على قاعدة بيانات محلية يمكن الحصول على نسخة احتياطية منها*💾\n تتيح المنظومة عدة خيارات للنسخة الاحتياطية  إما على البريد أو قواعد البيانات السحابية أو عبر رسائل whatsapp\nأرسل 👈 *!نسخة احتياطية* 👉 واتبع التعليمات`;

// استعادة نسخة
const Recovery = `🔙 *لاستعادة نسخة احتياطية أرسل إما عبر الرسائل whatsapp أو قواعد البيانات السحابية* 🔙\nأرسل 👈 *!استعادة* 👉 واتبع التعليمات`;

// بناء
const build = `🏗️ *لبناء الحسابات عبر من الواجهة الرسومية* 🏗️\nأرسل 👈 *!بناء* 👉 واتبع التعليمات لبناء الحسابات من كشوف الطلاب والمدرسين والإدارين والأمن الموجودة على google sheet`;

// صلاحية بريد
const emailAccess1 = `📧 *لإضافة صلاحية وصول مستخدم إلى قوائم الحسابات* 📧\nتمكن هذه الخاصية من إضافة أحد الإداريين من الوصول إلى قوائم الطلاب والمدرسين والإداريين والأمن وإمكانية تعديلها`;
const emailAccess2 = `أرسل 👈 "!صلاحية بريد" 👉 ليصلك الملاحظات الرئيسية ومن ثم يطلب منك إرسال البريد بطريقة سليمة لإضافته للقائمة`;
const emailAccess3 = `⚠️تنبيه هام: \n تعديل القوائم لا يؤثر على قواعد البيانات إلا في حالة استخدام الأمر 👈 *!بناء* 👉`;

const menu = {
  main,
  verify,
  tracking,
  cancel,
  activation1,
  activation2,
  activationTeacher1,
  activationTeacher2,
  booking1,
  booking2,
  booking3,
  myScedule,
  myViolations,
  restore1,
  restore2,
  restore3,
  dayBlock,
  dateBlock,
  BookingStatus,
  BookingStatus2,
  Rooms1,
  Rooms2,
  throw1,
  throw2,
  throw3,
  throw4,
  throw5,
  throwTeacher,
  showRules,
  RulesEditing,
  permissions,
  emailAccess1,
  emailAccess2,
  emailAccess3,
  backup,
  Recovery,
  build,
};

export default menu;
